In [1]:
import pandas as pd

In [2]:
x = ['Alex', 'John', 'jacob', 'Steve']
y1 = [60, 55, 75, 95]
y2 = [80, 46, 87, 90]

In [4]:
data = pd.DataFrame(zip(x, y1, y2), columns = ['Name', 'Old Grade', 'New Grade'])
data

    Name  Old Grade  New Grade
0   Alex         60         80
1   John         55         46
2  jacob         75         87
3  Steve         95         90

In [5]:
data.to_csv('data.csv')